app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('user')->get()->getResultArray();
---
SELECT *
FROM `user`

    public function LoginUser($username, $password)
    {
        return $this->db->table('user')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'owner'
AND `password` = '123'