app/Models/ModelMenu.php

    public function AllData()
    {
        return $this->db->table('menu')
            ->join('kategori', 'kategori.id_kategori=menu.id_kategori')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `menu`
JOIN `kategori` ON `kategori`.`id_kategori`=`menu`.`id_kategori`