app/Models/ModelPelanggan.php

    public function AllData()
    {
        return $this->db->table('pelanggan')->get()->getResultArray();
---
SELECT *
FROM `pelanggan`

    public function LoginPelanggan($username, $password)
    {
        return $this->db->table('pelanggan')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `pelanggan`
WHERE `username` = 'owner'
AND `password` = '123'