app/Models/ModelPesanan.php

SELECT `pesanan`.`id_pesanan`, `menu`.`id_menu`, `pesanan`.`id_menu`, `menu`.`nama_menu`, `menu`.`harga`, `pelanggan`.`id_pelanggan`, `pesanan`.`id_pelanggan`, `pelanggan`.`nama_pelanggan`, `pelanggan`.`jenis_kelamin`, `pelanggan`.`no_hp`, `pelanggan`.`alamat`, `pesanan`.`jumlah`, `meja`.`id_meja`, `pesanan`.`id_meja`, `meja`.`nomor_meja`, `user`.`id_user`, `pesanan`.`id_user`, `user`.`nama_user`, `user`.`level`, `transaksi`.`total`, `pesanan`.`total`
FROM `pesanan`
LEFT JOIN `menu` ON `menu`.`id_menu`=`pesanan`.`id_menu`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan`=`pesanan`.`id_pelanggan`
LEFT JOIN `meja` ON `meja`.`id_meja`=`pesanan`.`id_meja`
LEFT JOIN `user` ON `user`.`id_user`=`pesanan`.`id_user`
LEFT JOIN `transaksi` ON `transaksi`.`total`=`pesanan`.`total`
---
    public function AllData()
    {
        $db = $this->db->table('pesanan');
        $db->select('pesanan.id_pesanan');
        $db->select('menu.id_menu');
        $db->select('pesanan.id_menu');
        $db->select('menu.nama_menu');
        $db->select('menu.harga');
        $db->select('pelanggan.id_pelanggan');
        $db->select('pesanan.id_pelanggan');
        $db->select('pelanggan.nama_pelanggan');
        $db->select('pelanggan.jenis_kelamin');
        $db->select('pelanggan.no_hp');
        $db->select('pelanggan.alamat');
        $db->select('pesanan.jumlah');
        $db->select('meja.id_meja');
        $db->select('pesanan.id_meja');
        $db->select('meja.nomor_meja');
        $db->select('user.id_user');
        $db->select('pesanan.id_user');
        $db->select('user.nama_user');
        $db->select('user.level');
        $db->select('transaksi.total');
        $db->select('pesanan.total');
        $db->join('menu', 'menu.id_menu=pesanan.id_menu', 'left');
        $db->join('pelanggan', 'pelanggan.id_pelanggan=pesanan.id_pelanggan', 'left');
        $db->join('meja', 'meja.id_meja=pesanan.id_meja', 'left');
        $db->join('user', 'user.id_user=pesanan.id_user', 'left');
        $db->join('transaksi', 'transaksi.total=pesanan.total', 'left');
        return $db->get()->getResultArray();

UPDATE `pesanan` SET `id_pesanan` = '3', `id_pelanggan` = NULL, `id_menu` = NULL, `id_meja` = NULL, `jumlah` = '1', `id_user` = 'waiter', `total` = '50000'
WHERE `id_pesanan` = '3'
---
    public function UpdateData($data)
    {
        $this->db->table('pesanan')->where('id_pesanan', $data['id_pesanan'])->update($data);