app/Models/ModelTransaksi.php

SELECT *
FROM `transaksi`
---
    public function AllData()
    {
        return $this->db->table('transaksi')->get()->getResultArray();