app/Models/ModelKategori.php

    public function AllData()
    {
        return $this->db->table('kategori')->get()->getResultArray();
---
SELECT *
FROM `kategori`