app/Models/ModelMeja.php

    public function AllData()
    {
        return $this->db->table('meja')->get()->getResultArray();
---
SELECT *
FROM `meja`